Revit 2024 API
ParameterTypeId.RebarShapeSpiralBaseFinishingTurns Property
 "Base Finishing Turns"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeSpiralBaseFinishingTurns { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeSpiralBaseFinishingTurns As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeSpiralBaseFinishingTurns {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace